/**
 * Created by dell on 2017/10/25.
 * 俄罗斯中方块的代码
 */
var Squery = function(){

    //‘——’方块
    this.block_1 ={
        1: [
            [2,2,2,2],
            [0,0,0,0],
            [0,0,0,0],
            [0,0,0,0]
        ],
        2: [
            [0,2,0,0],
            [0,2,0,0],
            [0,2,0,0],
            [0,2,0,0]
        ]
    };
    //'-\_'方块
    var block_2={
        1: [
            [0,2,0,0],
            [0,2,2,0],
            [0,0,2,0],
            [0,0,0,0]
        ],
        2: [
            [0,0,0,0],
            [0,0,2,2],
            [2,2,0,0],
            [0,0,0,0]
        ]
    };

    //下个方块数据
    this.data =this.block_1[1];
    //当前方块
    this.curBlock = this.block_1;
    //下一个方块在game区域的原点
    this.origin = {
        x:0,
        y:0
    }
};